export const TABLES: string[] = ['Employee', 'Worker', 'Engineer', 'Administration', 'Department', 'Machinery', 'Building', 'Construction_work', 'Report'];
export const QUERY_TABLES: string[] = ['1_1. Получить перечень строительных управлений и их руководителей.',
    '1_2. Получить перечень строительных участков и их руководителей.',
    '2_1. Получить список специалистов инженерно-технического состава обозначенного участка' +
    'с указанием их должностей.',
    '2_2. Получить список специалистов инженерно-технического состава обозначенного Управления' +
    'с указанием их должностей.',
    '3_1. Получить перечень объектов, возводимых указанным ' +
    'участком, и графики их возведения.',
    '3_2. Получить перечень объектов, возводимых указанным ' +
    'управлением, и графики их возведения.',
    '4. Получить состав бригад, работавших (работающих) на строительстве указанного объекта.',
    '5. Получить перечень строительной техники, приданной указанному строительному ' +
    'управлению.',
    '6_1. Получить перечень строительной техники, выделенной на указанный объект',
    '7. Получить график и смету на строительство указанного объекта.',
    '8. Получить отчет о сооружении указанного объекта.',
    '10_1. Получить перечень видов строительных работ, по которым имело место превышение ' +
    'сроков выполнения в целом по ' +
    'организации.',
    '10_2. Получить перечень видов строительных работ, по которым имело место превышение ' +
    'сроков выполнения на указанном участке.',
    '10_3. Получить перечень видов строительных работ, по которым имело место превышение ' +
    'сроков выполнения на указанном управлении.',
    '11_1. Получить перечень строительных материалов, по которым имело место превышение ' +
    'сроков выполнения в целом по ' +
    'организации.',
    '11_2. Получить перечень строительных материалов, по которым имело место превышение ' +
    'сроков выполнения на указанном участке.',
    '11_3. Получить перечень строительных материалов, по которым имело место превышение ' +
    'сроков выполнения на указанном управлении.'];